{
    "README.md": "# Description\n \nTexas A&M's own Miss Reveille has been followed going to the Computing Services \nComplex by paparazi from The Battalion. Since she wants to keep this visit to the CSC private, we have apprehended the cameras from the paparazzi and have begun deleting all the photos. However, during our investigation we came\nacross one photo that seemed a little suspicious. Can you help us figure out what is happening?\n\n# Documetation\n\nA simple steganography challenge incorporating the analysis of metadata and a simple cipher challenge with the results.\n\n## Setup\n\n1. Deliver the user the image, *reveille.jpg*\n\n# Solution\n\nThis challenge should a simple steganography challenge. The encrypted flag can be discovered by looking at the images metadata. The encrypted flag is very blantant as it refers to dog noises and is listed as a comment.\n\n\n\n```\nexiftool reveille.jpg\n```\n\nThe flag contains all dog related words, \"woof\", \"bark\", and \"ruff\". The user can, either by hand or by script, translate these words into the components of morse, \"-\", \".\", and \" \" respectively.\n\n\nOnce the words are translated to morse. The morse can be translated to plain text and the flag is available.\n",
    "reveille.jpg": "[Binary file or unsupported type: jpg]",
    "scripts\\bark_flag.txt": "woof woof bark ruff bark bark ruff woof woof bark ruff bark ruff woof woof ruff woof bark bark bark bark woof ruff woof bark bark ruff woof woof woof woof woof ruff woof woof bark ruff woof ruff bark woof woof bark woof bark ruff bark bark bark ruff woof ruff bark woof woof woof woof ruff woof bark woof bark ruff bark woof woof woof ruff woof woof woof woof woof ruff woof bark bark bark ruff woof bark bark bark bark woof\n",
    "scripts\\decoder.py": "file = open(\"secret.txt\", \"r\")\nflag = file.readline()\n\nmorse_flag = \"\"\nfor word in flag.split(\" \"):\n    if word == \"woof\":\n        morse_flag += \"-\"\n    if word == \"bark\":\n        morse_flag += \".\"\n    if word == \"ruff\":\n        morse_flag += \" \"\n\nprint(morse_flag)",
    "scripts\\encoder.py": "file = open(\"morse_flag.txt\", \"r\")\nflag = file.readline()\n\nmorse_flag = \"\"\nfor letter in flag:\n    if letter == \"-\":\n        morse_flag += \"woof \"\n    if letter == \".\":\n        morse_flag += \"bark \"\n    if letter == \" \":\n        morse_flag += \"ruff \"\n\nprint(morse_flag)",
    "scripts\\flag.txt": "GIGEM-D0GT@ST1CJ0B-\n",
    "scripts\\morse_flag.txt": "--. .. --. . -- -....- -.. ----- --. - .--.-. ... - .---- -.-. .--- ----- -... -....-\n",
    "scripts\\secret.txt": "bark woof woof ruff bark bark woof bark ruff woof bark woof woof ruff woof woof woof bark bark ruff bark bark woof woof woof ruff woof woof bark woof ruff woof bark woof bark ruff bark woof woof bark ruff woof woof bark bark bark ruff woof bark ruff bark bark woof ruff bark bark bark woof woof ruff bark woof bark bark ruff woof woof bark ruff bark bark ruff woof woof bark ruff bark ruff woof woof ruff woof bark bark bark bark woof ruff woof bark bark ruff woof woof woof woof woof ruff woof woof bark ruff woof ruff bark woof woof bark woof bark ruff bark bark bark ruff woof ruff bark woof woof woof woof ruff woof bark woof bark ruff bark woof woof woof ruff woof woof woof woof woof ruff woof bark bark bark ruff woof bark bark bark bark woof ruff bark woof woof ruff bark bark woof bark ruff woof bark woof woof ruff woof woof woof bark bark ruff bark bark woof woof woof ruff bark bark bark woof ruff woof woof ruff woof woof bark ruff bark bark ruff bark bark bark bark bark ruff woof bark",
    "category": "Misc"
}