{
    "challenge.py": "from hacksport.problem import Challenge, File\n\n\nclass Problem(Challenge):\n    def setup(self):\n        pass\n\n    def generate_flag(self, random):\n        return r\"gigem{M42V3LisbetterthanDCC0M1C5}\"\n",
    "problem.json": "{\n  \"name\": \"Marvel vs DC\",\n  \"category\": \"OSINT\",\n  \"description\": \"Marvel or DC?\\n This young concept artist attended the Cleveland Institute of Art and has quite the fan base after working on several Marvel movies, notably Avengers Endgame and Black Panther.\\nYou are interested in his drawing techniques so you attend an art expo to learn more, can you find the flag? \\n\",\n  \"score\" : 250,\n  \"hints\": [\"\"],\n  \"walkthrough\": \"check our github or something\",\n  \"author\": \"Camryn Ochs\",\n  \"organization\": \"TAMUctf\",\n  \"event\": \"TAMUctf 2021\"\n}\n",
    "README.md": "# Marvel or DC?\n\n## Description\n\nThis young concept artist attended the Cleveland Institute of Art and has quite the fan base after working on several Marvel movies, notably Avengers Endgame and Black Panther. You are interested in his drawing techniques so you attend an art expo to learn more, can you find the flag?\n\n## Solution\n\n1. Identify the artist as Wes Burt; we did this by cross-referencing IMDb and the Cleveland Institute of Art graduates\n   for appropriate individuals. Note also the use of `his` pronoun in the description.\n2. Wes Burt notably discusses the Lightbox Expo on his Instagram account. \n3. A little searching later, we find the Lightbox Expo video archives! Looking back at the description, it's clear that\n   we're looking for videos which reference drawing techniques in particular.\n4. There's a [video on Schoolism](https://www.youtube.com/watch?v=3dc1Ud03XtY) which looks particularly relevant.\n5. Sorting the comments by newest, as YouTube sometimes omits comments which don't look like real text, we find the\n   flag.\n\nFlag: gigem{M42V3LisbetterthanDCC0M1C5}\n",
    "category": "osint"
}